yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8tl52g4.h
#define USART_CR3_LBCL           USART_CR3_bit.LBCL
#define USART_CR3_CPHA           USART_CR3_bit.CPHA
#define USART_CR3_CPOL           USART_CR3_bit.CPOL
#define USART_CR3_CLKEN          USART_CR3_bit.CLKEN
#define USART_CR3_STOP           USART_CR3_bit.STOP

#define USART_CR4_ADD            USART_CR4_bit.ADD

#endif

/*-------------------------------------------------------------------------
 *      USART bit masks
 *-----------------------------------------------------------------------*/
#define MASK_USART_SR_PE         0x01
#define MASK_USART_SR_FE         0x02
#define MASK_USART_SR_NF         0x04
#define MASK_USART_SR_OR         0x08
#define MASK_USART_SR_IDLE       0x10
#define MASK_USART_SR_RXNE       0x20
#define MASK_USART_SR_TC         0x40
#define MASK_USART_SR_TXE        0x80

#define MASK_USART_CR1_PIEN      0x01
#define MASK_USART_CR1_PS        0x02
#define MASK_USART_CR1_PCEN      0x04
#define MASK_USART_CR1_WAKE      0x08
#define MASK_USART_CR1_MSL       0x10
#define MASK_USART_CR1_USARTD    0x20
#define MASK_USART_CR1_T8        0x40
#define MASK_USART_CR1_R8        0x80

#define MASK_USART_CR2_SBK       0x01
#define MASK_USART_CR2_RWU       0x02
#define MASK_USART_CR2_REN       0x04
#define MASK_USART_CR2_TEN       0x08
#define MASK_USART_CR2_ILIEN     0x10
#define MASK_USART_CR2_RIEN      0x20
#define MASK_USART_CR2_TCIEN     0x40
#define MASK_USART_CR2_TIEN      0x80

#define MASK_USART_CR3_LBCL      0x01
#define MASK_USART_CR3_CPHA      0x02
#define MASK_USART_CR3_CPOL      0x04
#define MASK_USART_CR3_CLKEN     0x08
#define MASK_USART_CR3_STOP      0x30

#define MASK_USART_CR4_ADD       0x0F


/*-------------------------------------------------------------------------
 *      TIM2 register definitions
 *-----------------------------------------------------------------------*/
/* TIM2 Control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CEN         : 1;
  unsigned char UDIS        : 1;
  unsigned char URS         : 1;
  unsigned char OPM         : 1;
  unsigned char DIR         : 1;
  unsigned char CMS         : 2;
  unsigned char ARPE        : 1;
} __BITS_TIM2_CR1;
#endif
__IO_REG8_BIT(TIM2_CR1,    0x5250, __READ_WRITE, __BITS_TIM2_CR1);

/* TIM2 Control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 4;
  unsigned char MMS         : 3;
} __BITS_TIM2_CR2;
#endif
__IO_REG8_BIT(TIM2_CR2,    0x5251, __READ_WRITE, __BITS_TIM2_CR2);

/* TIM2 Slave Mode Control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMS         : 3;
  unsigned char             : 1;
  unsigned char TS          : 3;
  unsigned char MSM         : 1;
} __BITS_TIM2_SMCR;
#endif
__IO_REG8_BIT(TIM2_SMCR,   0x5252, __READ_WRITE, __BITS_TIM2_SMCR);

/* TIM2 external trigger register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ETF         : 4;
  unsigned char ETPS        : 2;
  unsigned char ECE         : 1;
  unsigned char ETP         : 1;
} __BITS_TIM2_ETR;
#endif
__IO_REG8_BIT(TIM2_ETR,    0x5253, __READ_WRITE, __BITS_TIM2_ETR);

/* TIM2 Interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIE         : 1;
  unsigned char CC1IE       : 1;
  unsigned char CC2IE       : 1;
  unsigned char             : 3;
  unsigned char TIE         : 1;
  unsigned char BIE         : 1;
} __BITS_TIM2_IER;
#endif
__IO_REG8_BIT(TIM2_IER,    0x5254, __READ_WRITE, __BITS_TIM2_IER);

/* TIM2 Status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
  unsigned char CC1IF       : 1;
  unsigned char CC2IF       : 1;
  unsigned char             : 3;
  unsigned char TIF         : 1;
  unsigned char BIF         : 1;
} __BITS_TIM2_SR1;
#endif
__IO_REG8_BIT(TIM2_SR1,    0x5255, __READ_WRITE, __BITS_TIM2_SR1);

/* TIM2 Status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char CC1OF       : 1;
  unsigned char CC2OF       : 1;
} __BITS_TIM2_SR2;
#endif
__IO_REG8_BIT(TIM2_SR2,    0x5256, __READ_WRITE, __BITS_TIM2_SR2);

/* TIM2 Event Generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
  unsigned char CC1G        : 1;
  unsigned char CC2G        : 1;
  unsigned char             : 3;
  unsigned char TG          : 1;
  unsigned char BG          : 1;
} __BITS_TIM2_EGR;
#endif
__IO_REG8_BIT(TIM2_EGR,    0x5257, __WRITE, __BITS_TIM2_EGR);

/* TIM2 Capture/Compare mode register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef union
{
  struct
  {
    unsigned char CC1S        : 2;
    unsigned char IC1PSC      : 2;
    unsigned char IC1F        : 3;
  } in;
  struct
  {
    unsigned char CC1S        : 2;
    unsigned char OC1FE       : 1;
    unsigned char OC1PE       : 1;
    unsigned char OC1M        : 3;
  } out;
} __BITS_TIM2_CCMR1;
#endif
__IO_REG8_BIT(TIM2_CCMR1,  0x5258, __READ_WRITE, __BITS_TIM2_CCMR1);

/* TIM2 Capture/Compare mode register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef union
{
  struct
  {
    unsigned char CC2S        : 2;
    unsigned char IC2PSC      : 2;
    unsigned char IC2F        : 3;
  } in;
  struct
  {
    unsigned char CC2S        : 2;
    unsigned char OC2FE       : 1;
    unsigned char OC2PE       : 1;
    unsigned char OC2M        : 3;
  } out;
} __BITS_TIM2_CCMR2;
#endif
__IO_REG8_BIT(TIM2_CCMR2,  0x5259, __READ_WRITE, __BITS_TIM2_CCMR2);

/* TIM2 Capture/Compare enable register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1E        : 1;
  unsigned char CC1P        : 1;
  unsigned char             : 2;
  unsigned char CC2E        : 1;
  unsigned char CC2P        : 1;
} __BITS_TIM2_CCER1;
#endif
__IO_REG8_BIT(TIM2_CCER1,  0x525A, __READ_WRITE, __BITS_TIM2_CCER1);

/* TIM2 Counter high */
__IO_REG8    (TIM2_CNTRH,  0x525B, __READ_WRITE);
/* TIM2 Counter low */
__IO_REG8    (TIM2_CNTRL,  0x525C, __READ_WRITE);
/* TIM2 Prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC         : 3;
} __BITS_TIM2_PSCR;
#endif
__IO_REG8_BIT(TIM2_PSCR,   0x525D, __READ_WRITE, __BITS_TIM2_PSCR);

/* TIM2 Auto-reload register high */
__IO_REG8    (TIM2_ARRH,   0x525E, __READ_WRITE);
/* TIM2 Auto-reload register low */
__IO_REG8    (TIM2_ARRL,   0x525F, __READ_WRITE);
/* TIM2 Capture/Compare register 1 high */
__IO_REG8    (TIM2_CCR1H,  0x5260, __READ_WRITE);
/* TIM2 Capture/Compare register 1 low */
__IO_REG8    (TIM2_CCR1L,  0x5261, __READ_WRITE);
/* TIM2 Capture/Compare register 2 high */
__IO_REG8    (TIM2_CCR2H,  0x5262, __READ_WRITE);
/* TIM2 Capture/Compare register 2 low */
__IO_REG8    (TIM2_CCR2L,  0x5263, __READ_WRITE);
/* TIM2 Break register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LOCK        : 2;
  unsigned char OSSI        : 1;
  unsigned char             : 1;
  unsigned char BKE         : 1;
  unsigned char BKP         : 1;
  unsigned char AOE         : 1;
  unsigned char MOE         : 1;
} __BITS_TIM2_BKR;
#endif
__IO_REG8_BIT(TIM2_BKR,    0x5264, __READ_WRITE, __BITS_TIM2_BKR);

