yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8tl52g4.h
/* ProxSense receiver sampling capacitor selection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RX1CSSEL    : 5;
} __BITS_PXS_RX1CSSELR;
#endif
__IO_REG8_BIT(PXS_RX1CSSELR, 0x5341, __READ_WRITE, __BITS_PXS_RX1CSSELR);

/* ProxSense receiver sampling capacitor selection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RX2CSSEL    : 5;
} __BITS_PXS_RX2CSSELR;
#endif
__IO_REG8_BIT(PXS_RX2CSSELR, 0x5342, __READ_WRITE, __BITS_PXS_RX2CSSELR);

/* ProxSense receiver sampling capacitor selection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RX3CSSEL    : 5;
} __BITS_PXS_RX3CSSELR;
#endif
__IO_REG8_BIT(PXS_RX3CSSELR, 0x5343, __READ_WRITE, __BITS_PXS_RX3CSSELR);

/* ProxSense receiver sampling capacitor selection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RX4CSSEL    : 5;
} __BITS_PXS_RX4CSSELR;
#endif
__IO_REG8_BIT(PXS_RX4CSSELR, 0x5344, __READ_WRITE, __BITS_PXS_RX4CSSELR);

/* ProxSense receiver sampling capacitor selection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RX5CSSEL    : 5;
} __BITS_PXS_RX5CSSELR;
#endif
__IO_REG8_BIT(PXS_RX5CSSELR, 0x5345, __READ_WRITE, __BITS_PXS_RX5CSSELR);

/* ProxSense receiver sampling capacitor selection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RX6CSSEL    : 5;
} __BITS_PXS_RX6CSSELR;
#endif
__IO_REG8_BIT(PXS_RX6CSSELR, 0x5346, __READ_WRITE, __BITS_PXS_RX6CSSELR);

/* ProxSense receiver sampling capacitor selection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RX7CSSEL    : 5;
} __BITS_PXS_RX7CSSELR;
#endif
__IO_REG8_BIT(PXS_RX7CSSELR, 0x5347, __READ_WRITE, __BITS_PXS_RX7CSSELR);

/* ProxSense receiver sampling capacitor selection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RX8CSSEL    : 5;
} __BITS_PXS_RX8CSSELR;
#endif
__IO_REG8_BIT(PXS_RX8CSSELR, 0x5348, __READ_WRITE, __BITS_PXS_RX8CSSELR);

/* ProxSense receiver sampling capacitor selection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RX9CSSEL    : 5;
} __BITS_PXS_RX9CSSELR;
#endif
__IO_REG8_BIT(PXS_RX9CSSELR, 0x5349, __READ_WRITE, __BITS_PXS_RX9CSSELR);

/* ProxSense receiver electrode parasitic compensation capacitor selection register */
__IO_REG8    (PXS_RX0EPCCSELR, 0x5350, __READ_WRITE);
/* ProxSense receiver electrode parasitic compensation capacitor selection register */
__IO_REG8    (PXS_RX1EPCCSELR, 0x5351, __READ_WRITE);
/* ProxSense receiver electrode parasitic compensation capacitor selection register */
__IO_REG8    (PXS_RX2EPCCSELR, 0x5352, __READ_WRITE);
/* ProxSense receiver electrode parasitic compensation capacitor selection register */
__IO_REG8    (PXS_RX3EPCCSELR, 0x5353, __READ_WRITE);
/* ProxSense receiver electrode parasitic compensation capacitor selection register */
__IO_REG8    (PXS_RX4EPCCSELR, 0x5354, __READ_WRITE);
/* ProxSense receiver electrode parasitic compensation capacitor selection register */
__IO_REG8    (PXS_RX5EPCCSELR, 0x5355, __READ_WRITE);
/* ProxSense receiver electrode parasitic compensation capacitor selection register */
__IO_REG8    (PXS_RX6EPCCSELR, 0x5356, __READ_WRITE);
/* ProxSense receiver electrode parasitic compensation capacitor selection register */
__IO_REG8    (PXS_RX7EPCCSELR, 0x5357, __READ_WRITE);
/* ProxSense receiver electrode parasitic compensation capacitor selection register */
__IO_REG8    (PXS_RX8EPCCSELR, 0x5358, __READ_WRITE);
/* ProxSense receiver electrode parasitic compensation capacitor selection register */
__IO_REG8    (PXS_RX9EPCCSELR, 0x5359, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      ProxSense bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define PXS_CR1_LOW_POWER        PXS_CR1_bit.LOW_POWER
#define PXS_CR1_START            PXS_CR1_bit.START
#define PXS_CR1_PXSEN            PXS_CR1_bit.PXSEN

#define PXS_CR2_SYNCEDGE         PXS_CR2_bit.SYNCEDGE
#define PXS_CR2_SYNCEN           PXS_CR2_bit.SYNCEN
#define PXS_CR2_RXCOUPLING       PXS_CR2_bit.RXCOUPLING
#define PXS_CR2_RXGROUP          PXS_CR2_bit.RXGROUP
#define PXS_CR2_NOISEDETEN       PXS_CR2_bit.NOISEDETEN
#define PXS_CR2_FCCITEN          PXS_CR2_bit.FCCITEN
#define PXS_CR2_EOCITEN          PXS_CR2_bit.EOCITEN

#define PXS_CR3_VTHR             PXS_CR3_bit.VTHR
#define PXS_CR3_BIAS             PXS_CR3_bit.BIAS
#define PXS_CR3_STAB             PXS_CR3_bit.STAB

#define PXS_ISR_SYNC_OVRF        PXS_ISR_bit.SYNC_OVRF
#define PXS_ISR_SYNCPF           PXS_ISR_bit.SYNCPF
#define PXS_ISR_CIPF             PXS_ISR_bit.CIPF
#define PXS_ISR_NOISEDETF        PXS_ISR_bit.NOISEDETF
#define PXS_ISR_FCCF             PXS_ISR_bit.FCCF
#define PXS_ISR_EOCF             PXS_ISR_bit.EOCF

#define PXS_CKCR1_PASSLEN        PXS_CKCR1_bit.PASSLEN
#define PXS_CKCR1_PREUPLENSC     PXS_CKCR1_bit.PREUPLENSC

#define PXS_CKCR2_INCPHASE       PXS_CKCR2_bit.INCPHASE
#define PXS_CKCR2_ANADEAD        PXS_CKCR2_bit.ANADEAD
#define PXS_CKCR2_PRESC          PXS_CKCR2_bit.PRESC

#define PXS_RXENRH_RXEN8         PXS_RXENRH_bit.RXEN8
#define PXS_RXENRH_RXEN9         PXS_RXENRH_bit.RXEN9

#define PXS_RXENRL_RXEN0         PXS_RXENRL_bit.RXEN0
#define PXS_RXENRL_RXEN1         PXS_RXENRL_bit.RXEN1
#define PXS_RXENRL_RXEN2         PXS_RXENRL_bit.RXEN2
#define PXS_RXENRL_RXEN3         PXS_RXENRL_bit.RXEN3
#define PXS_RXENRL_RXEN4         PXS_RXENRL_bit.RXEN4
#define PXS_RXENRL_RXEN5         PXS_RXENRL_bit.RXEN5
#define PXS_RXENRL_RXEN6         PXS_RXENRL_bit.RXEN6
#define PXS_RXENRL_RXEN7         PXS_RXENRL_bit.RXEN7

#define PXS_RXCR1H_RXCR1_8       PXS_RXCR1H_bit.RXCR1_8
#define PXS_RXCR1H_RXCR1_9       PXS_RXCR1H_bit.RXCR1_9

#define PXS_RXCR1L_RXCR1_0       PXS_RXCR1L_bit.RXCR1_0
#define PXS_RXCR1L_RXCR1_1       PXS_RXCR1L_bit.RXCR1_1
#define PXS_RXCR1L_RXCR1_2       PXS_RXCR1L_bit.RXCR1_2
#define PXS_RXCR1L_RXCR1_3       PXS_RXCR1L_bit.RXCR1_3
#define PXS_RXCR1L_RXCR1_4       PXS_RXCR1L_bit.RXCR1_4
#define PXS_RXCR1L_RXCR1_5       PXS_RXCR1L_bit.RXCR1_5
#define PXS_RXCR1L_RXCR1_6       PXS_RXCR1L_bit.RXCR1_6
#define PXS_RXCR1L_RXCR1_7       PXS_RXCR1L_bit.RXCR1_7

#define PXS_RXCR2H_RXCR2_8       PXS_RXCR2H_bit.RXCR2_8
#define PXS_RXCR2H_RXCR2_9       PXS_RXCR2H_bit.RXCR2_9

#define PXS_RXCR2L_RXCR2_0       PXS_RXCR2L_bit.RXCR2_0
#define PXS_RXCR2L_RXCR2_1       PXS_RXCR2L_bit.RXCR2_1
#define PXS_RXCR2L_RXCR2_2       PXS_RXCR2L_bit.RXCR2_2
#define PXS_RXCR2L_RXCR2_3       PXS_RXCR2L_bit.RXCR2_3
#define PXS_RXCR2L_RXCR2_4       PXS_RXCR2L_bit.RXCR2_4
#define PXS_RXCR2L_RXCR2_5       PXS_RXCR2L_bit.RXCR2_5
#define PXS_RXCR2L_RXCR2_6       PXS_RXCR2L_bit.RXCR2_6
#define PXS_RXCR2L_RXCR2_7       PXS_RXCR2L_bit.RXCR2_7

#define PXS_RXCR3H_RXCR3_8       PXS_RXCR3H_bit.RXCR3_8
#define PXS_RXCR3H_RXCR3_9       PXS_RXCR3H_bit.RXCR3_9

#define PXS_RXCR3L_RXCR3_0       PXS_RXCR3L_bit.RXCR3_0
#define PXS_RXCR3L_RXCR3_1       PXS_RXCR3L_bit.RXCR3_1
#define PXS_RXCR3L_RXCR3_2       PXS_RXCR3L_bit.RXCR3_2
#define PXS_RXCR3L_RXCR3_3       PXS_RXCR3L_bit.RXCR3_3
#define PXS_RXCR3L_RXCR3_4       PXS_RXCR3L_bit.RXCR3_4
#define PXS_RXCR3L_RXCR3_5       PXS_RXCR3L_bit.RXCR3_5
#define PXS_RXCR3L_RXCR3_6       PXS_RXCR3L_bit.RXCR3_6
#define PXS_RXCR3L_RXCR3_7       PXS_RXCR3L_bit.RXCR3_7

#define PXS_RXINSRH_RXINS8       PXS_RXINSRH_bit.RXINS8
#define PXS_RXINSRH_RXINS9       PXS_RXINSRH_bit.RXINS9

